package com.example.demo.utils.DesignPattern;

/**
 * @Author: likang
 * @Date: 2021/2/12 12:10
 */
public class UML {
/**
 * 1. 类 类使用包含类名、属性和操作且带有分隔线的矩形来表示。
 * 2.接口 接口使用一个带有名称的小圆圈来进行表示
 * 3.类之间的关系
 *      1. 依赖关系  箭头虚线
 *某个类的方法通过局部变量、方法的参数或者对静态方法的调用来访问另一个类
 *
 *      2. 关联关系 实现
 *用于表示一类对象与另一类对象之间的联系，如老师和学生、师傅和徒弟、丈夫和妻子等
 *
 *      3. 聚合关系  实线加空菱形
 *聚合关系也是通过成员对象来实现的，其中成员对象是整体对象的一部分，但是成员对象可以脱离整体对象而独立存在。例如，学校与老师的关系，学校包含老师，但如果学校停办了，老师依然存在。
 *
 *      4.组合关系  实线加满菱形
 *类之间的整体与部分的关系，但它是一种更强烈的聚合关系
 *
 *      5.泛化关系 泛化关系用带空心三角箭头的实线来表示
 *是父类与子类之间的关系，是一种继承关系
 *
 *      6.实现关系 实现关系使用带空心三角箭头的虚线来表示
 *实现（Realization）关系是接口与实现类之间的关系。
 *
 */


}
